- NumPy is great when it comes to mathematical computing. But it is still a low level tool when it comes to data munging. This is where Pandas prove useful as it uses NumPy and adds several more functionalities on top of it.
- Pandas is built on top of NumPy. Thus it is fast and efficient when it comes to data wrangling.
- Pandas includes features like intrinsic data alignment and offers data operation functions such as merge, groupby, join methods and so on, that makes it efficient for data wrangling and manipulation. It also offers functions for handling missing data values and is a great data standardization tool.  
### Pandas Data structures:  
- Data structures are the basic building blocks that helps data scientists wrangle and analyze data. The 4 main libraries of Pandas data structure are:  
__(1) Series:__ One-dimensional array-like structure used to represent a dataset and can be visualized as a single row dataset. Supports multiple data types such as integer, string and float.  
__(2) DataFrame:__ Two-dimensional labeled array and can be visualized as a typical spreadsheet structure or a SQL database table with rows and columns. It also supports multiple data types such as integer, string, float etc and can be formed in many ways. A Series can be an input to a Data Frame. Another Data Frame can also be an input to it.  
__(3) Panel:__ Three-dimensional labeled array and supports multiple data types. It is mainly used to represent and wrangle three-dimensional datasets and can be visualized as x,y and z axis. Items -> axis 0, Major axis -> rows, Minor axis -> columns  
__(4) Panel 4D:__ Four-dimensional array and not very widely used. It is in experimental phase. 
- Series and DataFrame are the two main data structures which Data Scientists use to tackle real world problems.

# Series:
- Series is a one-dimensional array-like object containing data and labels(or index).
- __Data Types:__ Integer, String, Python Object, Floating Point
- Series can be created in multiple ways with the help of data elements which, if defined properly, act as data input to create a series. Therefore, __data input__ can be an ndarray, dict, scalar, list.
- An ndarray can be used as an input to create Pandas series. The use of ndarry is recommended wherever the dataset is number-centric and requires complex numerical computing.
- A Pandas series can also be created using dictionary and it is very efficient when it comes to indexing or reindexing a dataset for data wrangling purposes. dict works in a key-value fashion, so use it whenever the dataset is structured as key-value pair.
- Scalar data is another way to create Series. It is a stand-alone quantity and works with both vector and scalar datasets that can be used accordingly.
- List is another basic Python data structure which can act as an input to create Pandas series. List can hold a range of values of multiple data types. So if a dataset appears as a list, use list as input to create series.  
__Steps to create a series:__  
- Import Pandas as it is the main library: __import pandas as pd__
- When dealing with ndarray or other NumPy functions, import NumPy: __import numpy as np__
- Apply the syntax and pass the data elements as arguments
__Syntax to create series:__ S = pd.Series(data, index = [index])

In [1]:
#creating series from list
import numpy as np
import pandas as pd

first_series = pd.Series(list('abcdef'))
print(first_series)    #data type : object

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [1]:
#creating series from ndarray
import numpy as np
import pandas as pd

np_country = np.array(['Luxembourg', 'Norway', 'Japan', 'Switzerland', 'United States', 'Qatar', 'Iceland', 'Sweden',
                       'Singapore', 'Denmark'])
print(type(np_country))

s_country = pd.Series(np_country)
print(s_country)     #data type: object

<class 'numpy.ndarray'>
0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sweden
8        Singapore
9          Denmark
dtype: object

In [3]:
#creating series from dict for faster operations
import numpy as np
import pandas as pd

#evaluate countries and their corresponding gdp per capita and print them as series
dict_country_gdp = pd.Series([52056.01781, 40258.80862, 40034.85063, 39578.07441, 39170.41371, 37958.23146, 37691.02733,
                             36152.66676, 34706.19047, 33630.24604, 33529.83052, 30860.12808], 
                             index = ['Luxembourg', 'Macao, China', 'Norway', 'Japan', 'Switzerland', 'Hong Kong, China', 
                                      'United States', 'Qatar', 'Iceland', 'Sweden', 'Singapore', 'Denmark'])
print(dict_country_gdp)    #data type : float64

Luxembourg          52056.01781
Macao, China        40258.80862
Norway              40034.85063
Japan               39578.07441
Switzerland         39170.41371
Hong Kong, China    37958.23146
United States       37691.02733
Qatar               36152.66676
Iceland             34706.19047
Sweden              33630.24604
Singapore           33529.83052
Denmark             30860.12808
dtype: float64

In [4]:
#creating Series from Scalar
import numpy as np
import pandas as pd

scalar_series = pd.Series(5., index = ['a','b','c','d','e'])
print(scalar_series)    #data type : float64

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

### Accessing elements in Series:
- Data can be accessed through different functions like __look up i.e. loc__, __ilook i.e. iloc__ by passing data element position or index range.

In [5]:
#access elements in the series 'dict_country_gdp'
dict_country_gdp[0]

52056.01781

In [6]:
#access first 5 countries from the series
dict_country_gdp[0:5]

Luxembourg      52056.01781
Macao, China    40258.80862
Norway          40034.85063
Japan           39578.07441
Switzerland     39170.41371
dtype: float64

In [7]:
#accessing a country by name or index by look up method
dict_country_gdp.loc['United States']

37691.02733

In [10]:
#accessing by looking up the index position by applying ilook method
dict_country_gdp.iloc[6]     #gdp per capita of United States

37691.02733

### Vectorized Operations in Series:
- Vectorized Operations are performed by the data element's position.

In [12]:
#adding two or more series
first_vector_series = pd.Series([1,2,3,4], index = ['a','b','c','d'])
second_vector_series = pd.Series([10, 20, 30, 40], index = ['a','b','c','d'])

#addition is performed on index level
first_vector_series + second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [13]:
#changing the values of indices & shuffling 2nd series
second_vector_series = pd.Series([10, 20, 30, 40], index = ['a','d','b','c'])

#adding two series
first_vector_series + second_vector_series  #got different output than previous as the data elements are bound to index position

a    11
b    32
c    43
d    24
dtype: int64

In [14]:
#adding two series with few common and few different indexes
second_vector_series = pd.Series([10,20,30,40], index = ['a','b','e','f'])

first_vector_series + second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

In [2]:
import pandas as pd

#adding two or more series
first_vector_series = pd.Series([1,2,3,4], index = ['a','b','c','d'])
second_vector_series = pd.Series([10, 20, 30, 40], index = ['e','f','g','h'])

#addition is performed on index level
first_vector_series + second_vector_series

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
f   NaN
g   NaN
h   NaN
dtype: float64

## String Handling:

__pandas.Series.str.lower__
- Converts all characters to lowercase. Equivalent to str.lower().  

__pandas.Series.str.upper__
- Converts all characters to uppercase. Equivalent to str.upper().  

__pandas.Series.str.title__
- Converts first character of each word to uppercase and remaining to lowercase. Equivalent to str.title(). 

__pandas.Series.str.capitalize__
- Convert strings in the Series/Index to be capitalized. Equivalent to str.capitalize().  

__pandas.Series.str.swapcase__
- Converts uppercase to lowercase and lowercase to uppercase. Equivalent to str.swapcase().

In [2]:
import pandas as pd
s = pd.Series(['lower', 'CAPITALS', 'this is a sentence', 'SwApCaSe'])
s

0                 lower
1              CAPITALS
2    this is a sentence
3              SwApCaSe
dtype: object

In [3]:
s.str.lower()

0                 lower
1              capitals
2    this is a sentence
3              swapcase
dtype: object

In [4]:
s.str.upper()

0                 LOWER
1              CAPITALS
2    THIS IS A SENTENCE
3              SWAPCASE
dtype: object

In [5]:
s.str.title()

0                 Lower
1              Capitals
2    This Is A Sentence
3              Swapcase
dtype: object

In [6]:
s.str.capitalize()

0                 Lower
1              Capitals
2    This is a sentence
3              Swapcase
dtype: object

In [7]:
s.str.swapcase()

0                 LOWER
1              capitals
2    THIS IS A SENTENCE
3              sWaPcAsE
dtype: object

__pandas.Series.str.cat__
- Series.str.cat(others=None, sep=None, na_rep=None, join=None)
- Concatenate strings in the Series/Index with given separator.
- If others is specified, this function concatenates the Series/Index and elements of others element-wise. If others is not passed, then all values in the Series/Index are concatenated into a single string with a given sep.

In [9]:
import numpy as np
s = pd.Series(['a', 'b', np.nan, 'd'])
s

0      a
1      b
2    NaN
3      d
dtype: object

In [10]:
s.str.cat(sep = ' ')

'a b d'

- By default, NA values in the Series are ignored. Using 'na_rep', they can be given a representation.

In [11]:
s.str.cat(sep = ' ', na_rep = '?')

'a b ? d'

In [12]:
#If others is specified, corresponding values are concatenated with the separator. Result will be a Series of strings.
s.str.cat(['A', 'B', 'C', 'D'], sep = ',')

0    a,A
1    b,B
2    NaN
3    d,D
dtype: object

In [13]:
#Missing values will remain missing in the result, but can again be represented using 'na_rep'
s.str.cat(['A', 'B', 'C', 'D'], sep = ',', na_rep = '-')

0    a,A
1    b,B
2    -,C
3    d,D
dtype: object

In [14]:
#If 'sep' is not specified, the values are concatenated without separation.
s.str.cat(['A', 'B', 'C', 'D'], na_rep = '-')

0    aA
1    bB
2    -C
3    dD
dtype: object

- Series with different indexes can be aligned before concatenation. The join-keyword works as in other methods.

In [15]:
s = pd.Series(['a', 'b', np.nan, 'd'])
print(s)
t = pd.Series(['d', 'a', 'e', 'c'], index=[3, 0, 4, 2])
print(t)

0      a
1      b
2    NaN
3      d
dtype: object
3    d
0    a
4    e
2    c
dtype: object

In [17]:
s.str.cat(t, na_rep = '-')

0    aa
1    b-
2    -c
3    dd
dtype: object

In [18]:
s.str.cat(t, join = 'left', na_rep = '-')

0    aa
1    b-
2    -c
3    dd
dtype: object

In [19]:
s.str.cat(t, join = 'outer', na_rep = '-')

0    aa
1    b-
2    -c
3    dd
4    -e
dtype: object

In [20]:
s.str.cat(t, join = 'inner', na_rep = '-')

0    aa
2    -c
3    dd
dtype: object

In [21]:
s.str.cat(t, join = 'right', na_rep = '-')

3    dd
0    aa
4    -e
2    -c
dtype: object

__pandas.Series.str.split__
- Series.str.split(pat=None, n=-1, expand=False)
- Split strings around given separator/delimiter. Equivalent to str.split().
- The handling of the n keyword depends on the number of found splits:  
If found splits > n, make first n splits only.  
If found splits <= n, make all splits.  
If for a certain row the number of found splits < n, append None for padding up to n if expand=True.  
- When using expand=True, the split elements will expand out into separate columns.
- For Series object, output return type is DataFrame.

In [22]:
s = pd.Series(["this is good text", "but this is even better"])
s

0          this is good text
1    but this is even better
dtype: object

In [23]:
s.str.split()

0           [this, is, good, text]
1    [but, this, is, even, better]
dtype: object

In [24]:
s.str.split('random')

0          [this is good text]
1    [but this is even better]
dtype: object

In [25]:
s.str.split(expand = True)

      0     1     2     3       4
0  this    is  good  text    None
1   but  this    is  even  better

In [26]:
s.str.split(" is ", expand = True)

          0            1
0      this    good text
1  but this  even better

- Parameter 'n' can be used to limit the number of splits in the output.

In [29]:
s.str.split('is', n = 1)

0          [th,  is good text]
1    [but th,  is even better]
dtype: object

In [30]:
s.str.split('is', n = 1, expand = True)

        0                1
0      th     is good text
1  but th   is even better

In [31]:
# If NaN is present, it is propagated throughout the columns during the split.
s = pd.Series(["this is good text", "but this is even better", np.nan])
s.str.split(n = 3, expand = True)

      0     1     2            3
0  this    is  good         text
1   but  this    is  even better
2   NaN   NaN   NaN          NaN

__pandas.Series.str.get_dummies__
- Split each string in the Series by sep and return a frame of dummy/indicator variables.
- Series.str.get_dummies(sep='|')

In [33]:
pd.Series(['a|b', 'a', 'a|c']).str.get_dummies()

   a  b  c
0  1  1  0
1  1  0  0
2  1  0  1

In [34]:
pd.Series(['a|b', np.nan, 'a|c']).str.get_dummies()

   a  b  c
0  1  1  0
1  0  0  0
2  1  0  1

__pandas.Series.str.partition__
- Series.str.partition(pat=' ', expand=True)
- Split the string at the first occurrence of sep, and return 3 elements containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return 3 elements containing the string itself, followed by two empty strings.

In [35]:
s = pd.Series(['A_B_C', 'D_E_F', 'X'])
s

0    A_B_C
1    D_E_F
2        X
dtype: object

In [36]:
s.str.partition('_')

   0  1    2
0  A  _  B_C
1  D  _  E_F
2  X

__pandas.Series.str.rpartition__
- Series.str.rpartition(pat=' ', expand=True)
- Split the string at the last occurrence of sep, and return 3 elements containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return 3 elements containing two empty strings, followed by the string itself.

In [37]:
s.str.rpartition('_')

     0  1  2
0  A_B  _  C
1  D_E  _  F
2          X

__pandas.Series.str.contains__
- Series.str.contains(pat, case=True, flags=0, na=nan, regex=True)
- Test if pattern or regex is contained within a string of a Series or Index.
- Return boolean Series or Index based on whether a given pattern or regex is contained within a string of a Series or Index.

In [38]:
s1 = pd.Series(['Mouse', 'dog', 'house and parrot', '23', np.NaN])
s1.str.contains('og', regex = False)

0    False
1     True
2    False
3    False
4      NaN
dtype: object

In [39]:
#Specifying case sensitivity using case
s1.str.contains('oG', case=True, regex=True)

0    False
1    False
2    False
3    False
4      NaN
dtype: object

- Specifying 'na' to be False instead of NaN replaces NaN values with False. If Series or Index does not contain NaN values the resultant dtype will be bool, otherwise, an object dtype.

In [40]:
s1.str.contains('og', na = False, regex = True)

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [41]:
#returning ‘house’ and ‘parrot’ within same string
s1.str.contains('house|parrot', regex=True)

0    False
1    False
2     True
3    False
4      NaN
dtype: object

In [42]:
#Ignoring case sensitivity using 'flags' with regex
import re
s1.str.contains('PARROT', flags = re.IGNORECASE, regex = True)

0    False
1    False
2     True
3    False
4      NaN
dtype: object

In [43]:
#Returning any digit using regular expression.
s1.str.contains('\d', regex = True)

0    False
1    False
2    False
3     True
4      NaN
dtype: object

In [44]:
s2 = pd.Series(['40','40.0','41','41.0','35'])
s2.str.contains('.0', regex=True)
#one might expect only s2[1] and s2[3] to return True. However, ‘.0’ as a regex matches any character followed by a 0.

0     True
1     True
2    False
3     True
4    False
dtype: bool

__pandas.Series.str.count__
- Series.str.count(pat, flags=0, **kwargs)
- This function is used to count the number of times a particular regex pattern is repeated in each of the string elements of the Series.
- Some characters need to be escaped when passing in pat. eg. '$'
- this has a special meaning in regex and must be escaped when finding this literal character.

In [45]:
s  = pd.Series(['A', 'B', 'Aaba', 'Baca', np.nan, 'CABA', 'cat'])
s

0       A
1       B
2    Aaba
3    Baca
4     NaN
5    CABA
6     cat
dtype: object

In [46]:
s.str.count('a')

0    0.0
1    0.0
2    2.0
3    2.0
4    NaN
5    0.0
6    1.0
dtype: float64

In [47]:
#Escape '$' to find the literal dollar sign.
s = pd.Series(['$', 'B', 'Aab$', '$$ca', 'C$B$', 'cat'])
s

0       $
1       B
2    Aab$
3    $$ca
4    C$B$
5     cat
dtype: object

In [48]:
s.str.count('\$')

0    1
1    0
2    1
3    2
4    2
5    0
dtype: int64

__pandas.Series.str.endswith__
- Series.str.endswith(pat, na=nan)
- Test if the end of each string element matches a pattern. Equivalent to str.endswith().

In [49]:
s = pd.Series(['bat', 'bear', 'caT', np.nan])
s

0     bat
1    bear
2     caT
3     NaN
dtype: object

In [50]:
s.str.endswith('t')

0     True
1    False
2    False
3      NaN
dtype: object

In [51]:
#Specifying na to be False instead of NaN.
s.str.endswith('t', na = False)

0     True
1    False
2    False
3    False
dtype: bool

__pandas.Series.str.startswith__
- Series.str.startswith(pat, na=nan)
- Test if the start of each string element matches a pattern.

In [52]:
s = pd.Series(['bat', 'Bear', 'cat', np.nan])
s

0     bat
1    Bear
2     cat
3     NaN
dtype: object

In [53]:
s.str.startswith('b')

0     True
1    False
2    False
3      NaN
dtype: object

In [54]:
#Specifying na to be False instead of NaN.
s.str.startswith('b', na = False)

0     True
1    False
2    False
3    False
dtype: bool

__pandas.Series.str.get__
- Series.str.get(i)
- Extract element from each component at specified position. Extract element from lists, tuples, or strings in each element in the Series/Index.

In [55]:
s = pd.Series(["String",
           (1, 2, 3),
           ["a", "b", "c"],
           123, -456,
           {1:"Hello", "2":"World"}])
s

0                        String
1                     (1, 2, 3)
2                     [a, b, c]
3                           123
4                          -456
5    {1: 'Hello', '2': 'World'}
dtype: object

In [56]:
s.str.get(1)

0        t
1        2
2        b
3      NaN
4      NaN
5    Hello
dtype: object

In [57]:
s.str.get(-1)

0       g
1       3
2       c
3     NaN
4     NaN
5    None
dtype: object

__pandas.Series.str.len__
- Series.str.len()
- Compute length of each string in the Series/Index.

In [58]:
s = pd.Series(["String",
           (1, 2, 3),
           ["a", "b", "c"],
           123, -456,
           {1:"Hello", "2":"World"}])
s

0                        String
1                     (1, 2, 3)
2                     [a, b, c]
3                           123
4                          -456
5    {1: 'Hello', '2': 'World'}
dtype: object

In [59]:
s.str.len()

0    6.0
1    3.0
2    3.0
3    NaN
4    NaN
5    2.0
dtype: float64

__pandas.Series.str.slice__
- Series.str.slice(start=None, stop=None, step=None)

In [60]:
s = pd.Series(["String",
           (1, 2, 3),
           ["a", "b", "c"],
           123, -456,
           {1:"Hello", "2":"World"}])
s

0                        String
1                     (1, 2, 3)
2                     [a, b, c]
3                           123
4                          -456
5    {1: 'Hello', '2': 'World'}
dtype: object

In [63]:
s.str.slice(start = 1, stop = 4, step = 1)

0       tri
1    (2, 3)
2    [b, c]
3       NaN
4       NaN
5       NaN
dtype: object

In [64]:
s.str.slice(start = 1, stop = 4, step = 2)

0      ti
1    (2,)
2     [b]
3     NaN
4     NaN
5     NaN
dtype: object

__pandas.Series.str.isalnum__
- Check whether all characters in each string in the Series/Index are alphanumeric. Equivalent to str.isalnum().

__pandas.Series.str.isalpha__  
- Check whether all characters in each string in the Series/Index are alphabetic. Equivalent to str.isalpha().  

__pandas.Series.str.isdigit__  
- Check whether all characters in each string in the Series/Index are digits. Equivalent to str.isdigit().  

__pandas.Series.str.isspace__  
- Check whether all characters in each string in the Series/Index are whitespace. Equivalent to str.isspace().  

__pandas.Series.str.isnumeric__  
- Check whether all characters in each string in the Series/Index are numeric. Equivalent to str.isnumeric().  

__pandas.Series.str.isdecimal__  
- Check whether all characters in each string in the Series/Index are decimal. Equivalent to str.isdecimal().

## Datetimelike Properties

__pandas.Series.dt.date__
- Returns numpy array of python datetime.date objects (namely, the date part of Timestamps without timezone information).

__pandas.Series.dt.time__
- Returns numpy array of datetime.time. The time part of the Timestamps.

__pandas.Series.dt.year__
- The year of the datetime.

__pandas.Series.dt.month__
- The month as January=1, December=12

__pandas.Series.dt.day__
- The days of the datetime.

__pandas.Series.dt.hour__
- The hours of the datetime

__pandas.Series.dt.week__
- The week ordinal of the year

__pandas.Series.dt.weekofyear__
- The week ordinal of the year

__pandas.Series.dt.dayofweek__
- The day of the week with Monday=0, Sunday=6

__pandas.Series.dt.quarter__
- The quarter of the date

# DataFrame:
- Data frame is a way to store data in rectangular grids that can easily be overviewed. Each row of these grids corresponds to measurements or values of an instance, while each column is a vector containing data for a specific variable. DataFrame is a two-dimensional labeled data structure with columns of potentially different data types.
- __Data Types:__ Integer, String, Python Object, Floating point
- __Data Inputs:__ ndarray, dict, list, Series, DataFrame

In [1]:
#creating DataFrame from Lists
import pandas as pd

#last 5 olympics data: place, year and number of countries participated
olympic_data_list = {'HostCity':['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'],
                    'Year' : [2012, 2008, 2004, 2000, 1996],
                    'No. of Participating Countries' : [205, 204, 201, 200, 197]}

#creating DataFrame
df_olympic_data = pd.DataFrame(olympic_data_list)
print(df_olympic_data)

  HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [4]:
#view dataframe
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [3]:
df_olympic_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [18]:
#creating DataFrame from a dictionary
olympic_data_dict = {'London':{2012:205}, 'Beijing':{2008:204}}  #here dict1 = Country name i.e. London, Beijing as column
#dict2 = Year i.e. 2012, 2008 as row

#creating DataFrame
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)
print(df_olympic_data_dict)   #The result displays NaN wherever the data is missing for the corresponding index

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [26]:
#creating DataFrame from dict of Series
import pandas as pd

#creating two series
#1st series represents the no. of countries participating for the given year
olympic_series_participation = pd.Series([205, 204, 201, 200, 197], index = [2012, 2008, 2004, 2000, 1996])
#2nd series represents the cities which held the Olympics that year 
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                                  index = [2012, 2008, 2004, 2000, 1996])

#creating DataFrame by assigning column names
df_olympic_series = pd.DataFrame({'No. of Participating Countries': olympic_series_participation,
                                 'Host Cities': olympic_series_country})

print(df_olympic_series)

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [29]:
#creating DataFrame from ndarray
import numpy as np
import pandas as pd

#creating an ndarray of Olympic years
np_array = np.array([2012, 2008, 2004, 2006])
#creating a dictionary with the ndarray
dict_ndarray = {'year':np_array}

#creating DataFrame
df_ndarray = pd.DataFrame(dict_ndarray)
print(df_ndarray)

   year
0  2012
1  2008
2  2004
3  2006

In [30]:
#creating DataFrame from DataFrame
import numpy as np
import pandas as pd

#creating DataFrame
df_from_df = pd.DataFrame(df_olympic_series)
print(df_from_df)

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [5]:
import numpy as np
import pandas as pd

data1 = np.array([['', 'Col1', 'Col2'],
                 ['Row1', 1, 2],
                 ['Row2', 3, 4]])

df_data = pd.DataFrame(data = data1[1:, 1:],
                  index = data1[1:, 0],
                  columns = data1[0, 1:])

print(df_data)
print("\n")

#print(df_data[0].count())

print(list(df_data.columns.values))
print("\n")
print(list(df_data.columns))

     Col1 Col2
Row1    1    2
Row2    3    4


['Col1', 'Col2']


['Col1', 'Col2']

In [5]:
import numpy as np
import pandas as pd

#taking a 2D array as input to the DataFrame
my_2darray = np.array([[1, 2, 3],[4, 5, 6]])
print(my_2darray)
my_df1 = pd.DataFrame(my_2darray)
print(my_df1)

#taking a dictionary as input to the DataFrame
my_dict = {1: ['1', '3'], 2: ['1', '2'], 3: ['2', '4']}
print(my_dict)
my_df2 = pd.DataFrame(my_dict)
print(my_df2)

#taking a DataFrame as input to the DataFrame
my_df3 = pd.DataFrame(data = [4, 5, 6, 7], index = range(0, 4), columns = ['A'])
print(my_df3)

#taking a series as input to the DataFrame
my_series = pd.Series({"Belgium":"Brussels", "India":"New Delhi", "United Kingdom":"London", "United States":"Washington"})
print(my_series)
my_df4 = pd.DataFrame(my_series)
print(my_df4)

[[1 2 3]
 [4 5 6]]
   0  1  2
0  1  2  3
1  4  5  6
{1: ['1', '3'], 2: ['1', '2'], 3: ['2', '4']}
   1  2  3
0  1  1  2
1  3  2  4
   A
0  4
1  5
2  6
3  7
Belgium             Brussels
India              New Delhi
United Kingdom        London
United States     Washington
dtype: object
                         0
Belgium           Brussels
India            New Delhi
United Kingdom      London
United States   Washington

### Viewing a DataFrame:
- You can view a DataFrame by refering to the column name or with the __describe__ function.

In [9]:
import pandas as pd

#last 5 olympics data: place, year and number of countries participated
olympic_data_list = {'HostCity':['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'],
                    'Year' : [2012, 2008, 2004, 2000, 1996],
                    'No. of Participating Countries' : [205, 204, 201, 200, 197]}

#creating DataFrame
df_olympic_data = pd.DataFrame(olympic_data_list)
print(df_olympic_data)
print("\n")

print(df_olympic_data.shape)  #shape property will provide the dimensions of the DataFrame.
print(len(df_olympic_data.index))

#view by column name
df_olympic_data.HostCity    #displays the values of column 'HostCity'

  HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197


(5, 3)
5

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [32]:
#view by describe function
df_olympic_data.describe     #contents of the entire dataset is returned

<bound method NDFrame.describe of   HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [10]:
import numpy as np
import pandas as pd

#creating dataframe from dict of series for summer olympics : 1996 to 2012
olympic_series_participation = pd.Series([205, 204, 201, 200, 197], index = [2012, 2008, 2004, 2000, 1996])
olympic_series_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], 
                                   index = [2012, 2008, 2004, 2000, 1996])

#creating dataframe
df_olympic_series = pd.DataFrame({'NO. of Participating Countries': olympic_series_participation,
                                 'Host Cities': olympic_series_country})

#display content of the dataset
df_olympic_series

      NO. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [11]:
#view dataframe describe
df_olympic_series.describe

<bound method NDFrame.describe of       NO. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta>

In [12]:
#view top 2 records
df_olympic_series.head(2)

      NO. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing

In [13]:
#view last 3 records
df_olympic_series.tail(3)

      NO. of Participating Countries Host Cities
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [14]:
#view indexes of dataset
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [15]:
#view columns of the dataset
df_olympic_series.columns

Index(['NO. of Participating Countries', 'Host Cities'], dtype='object')

### Select Data from a DataFrame:

In [16]:
#select data for Host Cities
df_olympic_series['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [17]:
#in case where space is there in a column name, it is better to write in the above way
df_olympic_series.Host Cities

SyntaxError: invalid syntax (<ipython-input-17-5e7575990d7b>, line 2)

In [18]:
#select data for NO. of Participating Countries
df_olympic_series['NO. of Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: NO. of Participating Countries, dtype: int64

In [19]:
#select label-location based access (by label)
df_olympic_series.loc[2012]

NO. of Participating Countries       205
Host Cities                       London
Name: 2012, dtype: object

In [20]:
#Integer-location based indexing by position
df_olympic_series.iloc[0:2]

      NO. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing

In [21]:
#Integer-Location based data selection by index value
df_olympic_series.iat[3, 1]   #3rd index row and 1st index column value

'Sydney'

In [27]:
#select by using boolean expression
#selecting data element by condition where number of participated countries are more than 200
df_olympic_series[df_olympic_series['NO. of Participating Countries'] > 200]

      NO. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens

### Missing Values:
- Missing values in a dataset are one of the most common challenges you can possibly come across. There can be several reasons due to which data can be missing or not present as expected. Major or common reason for inadequate or missing data:  
(1) Data not provided by the source  
(2) Network issue such as network or connection outage  
(3) Data integration issue where a data integration process tries to fetch data from various sources but failes to integrate  
(4) Software issues where data encoding and formatting are a common problem
- __Handling Missing Values__  
For example, here the first and second series hold data values and also has some indices which are common to both the series and some are not. While caluclating the sum of the two series, the sum of the series is actually the sum of the data elements which have common indices and others which are not common got treated as Not a Number (NaN).

In [16]:
import pandas as pd

#declare first series
first_series = pd.Series([1, 2, 3, 4, 5], index = ['a','b','c','d','e'])

#declare second series
second_series = pd.Series([10, 20, 30, 40, 50], index = ['c', 'e', 'f', 'g', 'h'])

sum_of_series = first_series + second_series
print(sum_of_series)

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

- It is hard to perform any kind of computation on the dataset which contains an NaN error and it must be fixed. There are a couple of built-in methods which can fix this problem such as __dropna__ and __fillna__. 
- __dropna()__ drops all the data elements with NaN value. If you want to preserve the same dataset for further operations, this function won't be helpful.

- __Fixing the above dataset and prepare the dataset for analysis purpose by using dropna():__

In [17]:
#drop NaN values from dataset
dropna_s = sum_of_series.dropna()
print(dropna_s)

c    13.0
e    25.0
dtype: float64

- __fillna()__ fills all the uncommon indices with a number instead of dropping them.

In [18]:
#filling the NaN values with zero instead of dropping them
fillna_s = sum_of_series.fillna(0)
print(fillna_s)

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [19]:
#fixing the dataset before performing the add operation

#fill values with zeros before performing addition operation for missing indices
fill_NaN_with_zeros_before_sum = first_series.add(second_series, fill_value=0)
#all the elements with uncommon indices in the second series will be filled with 0
print(fill_NaN_with_zeros_before_sum)

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

## Data Operation:
- Data operation can be performed through various built-in methods for analyzing data properly & faster data processing. By mastering the data operation techniques, you can wrangle data efficiently and accurately.

In [50]:
import pandas as pd

#declare movie rating dataframe: ratings from 1 to 5
df_movie_rating = pd.DataFrame({'movie 1': [5, 4, 3, 3, 2, 1],
                               'movie 2': [4, 5, 2, 3, 4, 2]},
                              index = ['Tom', 'Jeff', 'Peter', 'Ram', 'Ted', 'Paul'])

print(df_movie_rating)

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [51]:
#declaring a custome function named 'movie_grade'
def movie_grade(rating):
    if rating == 5:
        return 'A'
    elif rating == 4:
        return 'B'
    elif rating == 3:
        return 'C'
    else:
        return 'F'

print(movie_grade(5))

A

In [53]:
#applying movie_grade() to the entire movie rating dataset
#using applymap() and passing movie_grade() in the DataFrame df_movie_rating
df_movie_rating.applymap(movie_grade)   #This changes the dataset from star rating to the category grade

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

### Data Operation with Statistical Functions :

In [55]:
import pandas as pd

#creating dataframe with two test
df_test_scores = pd.DataFrame({'Test1': [95, 84, 73, 88, 82, 61],
                              'Test2': [74, 85, 82, 73, 77, 79]},
                             index = ['Jack', 'Lewis', 'Patrick', 'Rich', 'Kelly', 'Paula'])

print(df_test_scores)

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paula       61     79

In [56]:
#max() returns the maximum value
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [57]:
#mean() returns the average value
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [58]:
#std() retruns the standard deviation value
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

### Use of groupby():
- __groupby()__ is used to group the data elements by column or labels.

In [59]:
import pandas as pd

#creating a dataframe containing the first name and last name of former US presidents
df_president_name = pd.DataFrame({'first':['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
                                 'last':['Bush', 'Clinton', 'Regan', 'Carter', 'Washington']})

print(df_president_name)

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [62]:
#grouping the president names with the first name 'George'
grouped = df_president_name.groupby('first')
grp_data = grouped.get_group('George')
print(grp_data)    #the output displays the values which hold the names 'George'

    first        last
0  George        Bush
4  George  Washington

### Sorting:

In [65]:
#using sort_values() to sort the dataframe by first name
df_president_name.sort_values('first')  #the output arranges the elements in alphabatical order

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

### Data Standardization:
- As a data scientist, there can be several instances where you will observe unusual data values such as outliers. Such numbers may be spread in an abnormal distance than the mean value. Standardization is one of the most common ways that enables you to analyse a dataset and catch the outliers.

In [22]:
import pandas as pd

df_test_scores = pd.DataFrame({'Test1': [95, 84, 73, 88, 82, 61],
                              'Test2': [74, 85, 82, 73, 77, 79]},
                             index = ['Jack', 'Lewis', 'Patrick', 'Rich', 'Kelly', 'Paula'])

#creating a function to return the standardize value for the given data element
def standardize_tests(test):
    return (test - test.mean()) / test.std()

standardize_tests(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [23]:
standardize_tests(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

In [22]:
#applying the function to the entire dataset by means of the apply()
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

- The major distinction between __apply()__ and __applymap()__ is that 'apply' can return Series or DataFrame, whereas 'applymap' can return only a DataFrame.
### merge, find duplicates and concatenate the datasets:

In [24]:
import pandas as pd

#define the student data frame with math data
df_student_math = pd.DataFrame({'student':['Tom', 'Jack', 'Dan', 'Ram', 'Jeff', 'David'],
                               'ID':[10, 56, 31, 85, 9, 22]})

#define the student data frame with science data
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],
                                  'ID':[10, 12, 22]})

#merge both dataframes to form a single data frame with math and science data
pd.merge(df_student_math, df_student_science)   #merge() works where the ID matches

  student  ID
0     Tom  10
1   David  22

In [25]:
#merge with key
#passing student as a key to merge the dataset. This will return as output all the students which are present in both datasets
pd.merge(df_student_math, df_student_science, on = 'student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

- __left join__ populates all the records from the first left dataset for the given key.

In [27]:
#perform left join using ID as key
pd.merge(df_student_math, df_student_science, on = 'ID', how = 'left')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56       NaN
2       Dan  31       NaN
3       Ram  85       NaN
4      Jeff   9       NaN
5     David  22     David

In [28]:
#perform left join using ID as key and fill the NaN values with X
pd.merge(df_student_math, df_student_science, on = 'ID', how = 'left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [29]:
#concatenate dataframe
pd.concat([df_student_math, df_student_science], ignore_index = True)   #results in concatenated values for all the indexes

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [30]:
pd.concat([df_student_math, df_student_science], ignore_index = False)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
0     Tom  10
1     Ram  12
2   David  22

In [32]:
#create new dataframe by manipulating the two dataframes manually
#this dataframe contain duplicate values & indices too
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                      'ID':[10,56,10,85,9,56]})

#view the dataframe
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [33]:
#check for duplicate values
#false indicates that they are not duplicates whereas True indicates duplicate elements.
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [34]:
#drop duplicate values with student as key
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [35]:
#drop duplicate values with ID as key
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

## File Read and Write
- Pandas support multiple files for data analysis such as Excel, PyTables, Clipboard, HTML, pickle, dta, SAS, SQL, JSON, CSV.
- These files can be read and write with the help of __read_method__ and __to_method__.
- read_method indicates the ability to read a file type and to_method indicates an ability to write a particular file.

## SQL Operation
- __connect()__ is used to connect with SQLite3 memory database.
- __execute()__ is used to execute SQL command.
- __commit()__ completes the transaction.
- __fetchall()__ is used to fetch the result from the table.
- __executemany()__ is used to insert multiple records into the table.

In [37]:
import pandas as pd
#import sqllite
import sqlite3

#create SQL table
create_table = """create table student_score (Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL);"""

#execute the SQL statement
executeSQL = sqlite3.connect(':memory:')  #connect() is used to connect to sqlite3 memory database
executeSQL.execute(create_table)  #execute() is used to execute the sql command
executeSQL.commit()   #commit() completes the transaction & here it creates the table

#prepare a SQL query to fetch the data from table
SQL_query = executeSQL.execute('select * from student_score')

#fetch result from the SQLlite database
resultset = SQL_query.fetchall()   #fetchall() is used to fetch the records from the table

#view result (empty data)
resultset   #since the table is empty, it returns an empty list

[]

In [38]:
#prepare records to be inserted into SQL table through SQL statement
insertSQL = [(10, 'Jack', 85, 92),
            (29, 'Tom', 73, 89),
            (65, 'Ram', 65.5, 77),
            (5, 'Steve', 55, 91)]

#insert records into SQL table through SQL statement
insert_statement = "Insert into student_score values(?, ?, ?, ?)"
#question mark is a syntax for the insert statement

executeSQL.executemany(insert_statement, insertSQL)   #executemany() is used to insert multiple records into the table
executeSQL.commit()

SQL_query = executeSQL.execute("select * from student_score")

#fetching the resultset
resultset = SQL_query.fetchall()

#view the resultset
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [39]:
SQL_query.description

(('Id', None, None, None, None, None, None),
 ('Name', None, None, None, None, None, None),
 ('Math', None, None, None, None, None, None),
 ('Science', None, None, None, None, None, None))

In [40]:
#put the records together in a dataframe
#zip() puts the columns together and records get stored as observations in the pandas dataframe.
column = list(zip(*SQL_query.description))
print(column)
print("\n")

df_student_records = pd.DataFrame(resultset, columns = column[0])
print(df_student_records)

[('Id', 'Name', 'Math', 'Science'), (None, None, None, None), (None, None, None, None), (None, None, None, None), (None, None, None, None), (None, None, None, None), (None, None, None, None)]


   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0

## Practice Project1: Analyse the Federal Aviation Authority Dataset using Pandas
DESCRIPTION

Problem:

Analyze the Federal Aviation Authority (FAA) dataset using Pandas to do the following:

1. View
- aircraft make name
- state name
- aircraft model name
- text information
- flight phase
- event description type
- fatal flag
2. Clean the dataset and replace the fatal flag NaN with “No”

3. Find the aircraft types and their occurrences in the dataset

4. Remove all the observations where aircraft names are not available

5. Display the observations where fatal flag is “Yes”

In [41]:
import pandas as pd

#read the federal aviation authority (FAA) csv dataset
fed_avn = pd.read_csv("C:\\Users\\HP\\Desktop\\New folder\\Python\\Lesson 7 -1\\faa_ai_prelim\\faa_ai_prelim.csv")

In [42]:
#view the dataset shape
fed_avn.shape

(83, 42)

In [43]:
#view the first five observations
fed_avn.head(5)

,UPDATED,ENTRY_DATE,EVENT_LCL_DATE,EVENT_LCL_TIME,LOC_CITY_NAME,LOC_STATE_NAME,LOC_CNTRY_NAME,RMK_TEXT,EVENT_TYPE_DESC,FSDO_DESC,...,PAX_INJ_NONE,PAX_INJ_MINOR,PAX_INJ_SERIOUS,PAX_INJ_FATAL,PAX_INJ_UNK,GRND_INJ_NONE,GRND_INJ_MINOR,GRND_INJ_SERIOUS,GRND_INJ_FATAL,GRND_INJ_UNK
0,No,19-FEB-16,19-FEB-16,00:45:00Z,MARSHVILLE,North Carolina,NaN,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",Accident,FAA Charlotte FSDO-68,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,No,19-FEB-16,18-FEB-16,23:55:00Z,TAVERNIER,Florida,NaN,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,Incident,FAA Miami FSDO-19,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,No,19-FEB-16,18-FEB-16,22:14:00Z,TRENTON,New Jersey,NaN,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",Incident,FAA Philadelphia FSDO-17,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,No,19-FEB-16,18-FEB-16,17:10:00Z,ASHEVILLE,North Carolina,NaN,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",Incident,FAA Charlotte FSDO-68,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,No,19-FEB-16,18-FEB-16,00:26:00Z,TALKEETNA,Alaska,NaN,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",Incident,FAA Anchorage FSDO-03,...,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
#view the columns present in the dataset
fed_avn.columns

Index(['UPDATED', 'ENTRY_DATE', 'EVENT_LCL_DATE', 'EVENT_LCL_TIME',
       'LOC_CITY_NAME', 'LOC_STATE_NAME', 'LOC_CNTRY_NAME', 'RMK_TEXT',
       'EVENT_TYPE_DESC', 'FSDO_DESC', 'REGIST_NBR', 'FLT_NBR', 'ACFT_OPRTR',
       'ACFT_MAKE_NAME', 'ACFT_MODEL_NAME', 'ACFT_MISSING_FLAG',
       'ACFT_DMG_DESC', 'FLT_ACTIVITY', 'FLT_PHASE', 'FAR_PART', 'MAX_INJ_LVL',
       'FATAL_FLAG', 'FLT_CRW_INJ_NONE', 'FLT_CRW_INJ_MINOR',
       'FLT_CRW_INJ_SERIOUS', 'FLT_CRW_INJ_FATAL', 'FLT_CRW_INJ_UNK',
       'CBN_CRW_INJ_NONE', 'CBN_CRW_INJ_MINOR', 'CBN_CRW_INJ_SERIOUS',
       'CBN_CRW_INJ_FATAL', 'CBN_CRW_INJ_UNK', 'PAX_INJ_NONE', 'PAX_INJ_MINOR',
       'PAX_INJ_SERIOUS', 'PAX_INJ_FATAL', 'PAX_INJ_UNK', 'GRND_INJ_NONE',
       'GRND_INJ_MINOR', 'GRND_INJ_SERIOUS', 'GRND_INJ_FATAL', 'GRND_INJ_UNK'],
      dtype='object')

In [45]:
#create a new data frame with only required columns
df_analyze_dataset = fed_avn[['ACFT_MAKE_NAME', 'LOC_STATE_NAME', 'ACFT_MODEL_NAME',
                             'RMK_TEXT', 'FLT_PHASE','EVENT_TYPE_DESC', 'FATAL_FLAG']]

In [46]:
#view the type of the object
type(df_analyze_dataset)

pandas.core.frame.DataFrame

In [47]:
#view first five observations
df_analyze_dataset.head(5)

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
1,VANS,Florida,RV7,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,LANDING (LDG),Incident,NaN
2,CESSNA,New Jersey,172,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",APPROACH (APR),Incident,NaN
3,LANCAIR,North Carolina,235,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",LANDING (LDG),Incident,NaN
4,CESSNA,Alaska,172,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",LANDING (LDG),Incident,NaN

In [48]:
#replace all NaN for Fatal_Flag with 'No'
df_analyze_dataset['FATAL_FLAG'].fillna(value = 'No', inplace = True)

C:\Users\HP\anaconda3\lib\site-packages\pandas\core\series.py:4517: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [49]:
#view the first five observations
df_analyze_dataset.head(5)

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
1,VANS,Florida,RV7,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,LANDING (LDG),Incident,No
2,CESSNA,New Jersey,172,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",APPROACH (APR),Incident,No
3,LANCAIR,North Carolina,235,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",LANDING (LDG),Incident,No
4,CESSNA,Alaska,172,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",LANDING (LDG),Incident,No

In [50]:
#view the shape of the dataset
df_analyze_dataset.shape

(83, 7)

In [51]:
#drop values where ACFT_MAKE_NAME (aircraft make name) is not available
df_final_dataset = df_analyze_dataset.dropna(subset = ['ACFT_MAKE_NAME'])

In [52]:
#view the new shape of the dataset
df_final_dataset.shape

(78, 7)

In [53]:
#group the aircraft name
aircraftType = df_final_dataset.groupby('ACFT_MAKE_NAME')

In [55]:
#view the aircraft by using size method
aircraftType.size()   #it will show the list of all the aircraft types and the number of times they appear in the dataset

ACFT_MAKE_NAME
AERO COMMANDER             1
AERONCA                    1
AEROSTAR INTERNATIONAL     1
AIRBUS                     1
BEECH                      9
BELL                       2
BOEING                     3
CESSNA                    23
CHAMPION                   2
CHRISTEN                   1
CONSOLIDATED VULTEE        1
EMBRAER                    1
ENSTROM                    1
FAIRCHILD                  1
FLIGHT DESIGN              1
GLOBE                      1
GREAT LAKES                1
GRUMMAN                    1
GULFSTREAM                 1
HUGHES                     1
LANCAIR                    2
MAULE                      1
MOONEY                     4
NORTH AMERICAN             1
PIPER                     10
PITTS                      1
SAAB                       1
SABRELINER                 1
SOCATA                     2
VANS                       1
dtype: int64

In [56]:
#grouping the dataset by fatal flag
fatalAccidents = df_final_dataset.groupby('FATAL_FLAG')

In [59]:
#view the fatal accidents size
fatalAccidents.size()

FATAL_FLAG
No     71
Yes     7
dtype: int64

In [60]:
#select the accidents with fatality with fatal falg yes
accidents_with_fatality = fatalAccidents.get_group('Yes')

In [61]:
#view the accidents with fatality
accidents_with_fatality

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
53,PIPER,Florida,PA28,AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES. ...,UNKNOWN (UNK),Accident,Yes
55,FLIGHT DESIGN,California,CTLS,AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES A...,UNKNOWN (UNK),Accident,Yes
79,NORTH AMERICAN,Arizona,F51,"AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES, ...",UNKNOWN (UNK),Accident,Yes
80,CHAMPION,California,8KCAB,"N9872R, BEECH M35 AIRCRAFT, AND N5057G, BELLAN...",UNKNOWN (UNK),Accident,Yes
81,BEECH,California,35,"N9872R, BEECH M35 AIRCRAFT, AND N5057G, BELLAN...",UNKNOWN (UNK),Accident,Yes
82,CESSNA,Alabama,182,N784CP AIRCRAFT CRASHED INTO A WOODED AREA NEA...,UNKNOWN (UNK),Accident,Yes

## Practice Project2 : Analyse NewYork city fire department Dataset
DESCRIPTION

What to:

A dataset in CSV format is given for the Fire Department of New York City. Analyze the dataset to determine:  

(1)The total number of fire department facilities in New York city  
(2)The number of fire department facilities in each borough  
(3)The facility names in Manhattan

In [65]:
import pandas as pd

#read NewYork city fire department csv Dataset
ny_fire_dept = pd.read_csv("C:\\Users\\HP\\Desktop\\New folder\\Python\\Lesson 7 -2\\FDNY\\FDNY.csv")

In [66]:
#view the contents of the data
ny_fire_dept.describe

<bound method NDFrame.describe of                                           FacilityName  \
0                                         FacilityName
1                                   Engine 4/Ladder 15
2                                  Engine 10/Ladder 10
3                                             Engine 6
4    Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...
..                                                 ...
214                  Engine 162/Ladder 82/Battalion 23
215                               Engine 167/Ladder 87
216                               Engine 164/Ladder 84
217                          Engine 168/EMS Station 23
218                               Engine 151/Ladder 76

              FacilityAddress        Borough
0             FacilityAddress        Borough
1             42 South Street      Manhattan
2          124 Liberty Street      Manhattan
3           49 Beekman Street      Manhattan
4        100-104 Duane Street      Manhattan
..                        ...            ...
214         256 Nelson Avenue  Staten Island
215         345 Annadale Road  Staten Island
216  1560 Drumgoole Road West  Staten Island
217     1100 Rossville Avenue  Staten Island
218           7219 Amboy Road  Staten Island

[219 rows x 3 columns]>

In [67]:
#view the first five records
ny_fire_dept.head(5)

,FacilityName,FacilityAddress,Borough
0,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan

In [68]:
#skip the first row from dataset
df_fdny_csv_data = pd.read_csv("C:\\Users\\HP\\Desktop\\New folder\\Python\\Lesson 7 -2\\FDNY\\FDNY.csv", skiprows=1)

In [69]:
#view first five records from fixed dataset
df_fdny_csv_data.head(5)

,FacilityName,FacilityAddress,Borough
0,Engine 4/Ladder 15,42 South Street,Manhattan
1,Engine 10/Ladder 10,124 Liberty Street,Manhattan
2,Engine 6,49 Beekman Street,Manhattan
3,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
4,Ladder 8,14 North Moore Street,Manhattan

In [71]:
#view data statistics using describe()
df_fdny_csv_data.describe()

                 FacilityName     FacilityAddress   Borough
count                     218                 218       218
unique                    218                 218         5
top     Engine 309/Ladder 159  2900 Snyder Avenue  Brooklyn
freq                        1                   1        66

In [72]:
#view columns of the dataset
df_fdny_csv_data.columns

Index(['FacilityName', 'FacilityAddress', 'Borough'], dtype='object')

In [73]:
#view index of the dataset
df_fdny_csv_data.index

RangeIndex(start=0, stop=218, step=1)

In [74]:
#count number of records
df_fdny_csv_data.count()

FacilityName       218
FacilityAddress    218
Borough            218
dtype: int64

In [76]:
#view datatypes
df_fdny_csv_data.dtypes

FacilityName       object
FacilityAddress    object
Borough            object
dtype: object

In [77]:
#select Fire Department of New York City(FDNY) information borough wise
groupby_borough = df_fdny_csv_data.groupby("Borough")

In [78]:
#view FDNY information for each borough
groupby_borough.size()

Borough
Bronx            34
Brooklyn         66
Manhattan        48
Queens           50
Staten Island    20
dtype: int64

In [79]:
#select FDNY information for Manhattan
fdny_info_Manhattan = groupby_borough.get_group("Manhattan")

In [80]:
#View FDNY information for Manhattan
fdny_info_Manhattan

,FacilityName,FacilityAddress,Borough
0,Engine 4/Ladder 15,42 South Street,Manhattan
1,Engine 10/Ladder 10,124 Liberty Street,Manhattan
2,Engine 6,49 Beekman Street,Manhattan
3,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
4,Ladder 8,14 North Moore Street,Manhattan
5,Engine 9/Ladder 6,75 Canal Street,Manhattan
6,Engine 15/Ladder 18/Battalion 4,25 Pitt Street,Manhattan
7,Engine 28/Ladder 11,222 East 2nd Street,Manhattan
8,Engine 5,340 East 14th Street,Manhattan
9,Engine 55,363 Broome Street,Manhattan
10,Ladder 20/Division 1,253 Lafayette Street,Manhattan
11,Engine 24/Ladder 5/Battalion 2,227-29 6th Avenue,Manhattan
12,Engine 33/Ladder 9,42 Great Jones Street,Manhattan
13,Ladder 3/Battalion 6,108 East 13th Street,Manhattan
14,Squad 18,132 West 10th Street,Manhattan
15,Engine 34/Ladder 21,440 West 38th Street,Manhattan
16,Engine 26,220 West 37th Street,Manhattan
17,Engine 3/Ladder 12/Battalion 7,150 West 19th Street,Manhattan
18,Engine 1/Ladder 24,142-46 West 31st Street,Manhattan
19,Engine 14,14 East 18th Street,Manhattan
20,Engine 16 / Ladder 7,234 East 29th Street,Manhattan
21,Engine 21,238 East 40th Street,Manhattan
22,Engine 54/Ladder 4/Battalion 9,782 8th Avenue,Manhattan
23,Engine 23,215 West 58th Street,Manhattan
24,Rescue 1,530 West 43rd Street,Manhattan
25,Engine 40/Ladder 35,131 Amsterdam Avenue,Manhattan
26,Ladder 25/District Office 4/Division 3,205-207 West 77th Street,Manhattan
27,Engine 74,120 West 83rd Street,Manhattan
28,Engine 65,33 West 43rd Street,Manhattan
29,Engine 8 / Ladder 2 / Battalion 8,167 East 51st Street,Manhattan
30,Engine 39/Ladder 16,157-59 East 67th Street,Manhattan
31,Engine 44,221 East 75th Street,Manhattan
32,Engine 22/Ladder 13/Battalion 10,159 East 85th Street,Manhattan
33,Engine 58/Ladder 26,1367 5th Avenue,Manhattan
34,Engine 53/Ladder 43,1836-46 3rd Avenue,Manhattan
35,Engine 91,242 East 111th Street,Manhattan
36,Engine 35/Ladder 14,2282 3rd Avenue,Manhattan
37,Engine 76/Ladder 22/Battalion 11,145-51 West 100th Street,Manhattan
38,Engine 47,502 West 113th Street,Manhattan
39,Engine 59/Ladder 30,111 West 133rd Street,Manhattan
40,Engine 37/Ladder 40,415 West 125th Street,Manhattan
41,Engine 69/Ladder 28/Battalion 16,248 West 143rd Street,Manhattan
42,Engine 80/Ladder 23,503 West 139th Street,Manhattan
43,Engine 84/Ladder 34,513 West 161st Street,Manhattan
44,Engine 67,518 West 170th Street,Manhattan
45,Engine 93/Ladder 45/Battalion 13,515 West 181st Street,Manhattan
46,Engine 95/Ladder 36,29 Vermilyea Avenue,Manhattan
47,Marine 1,Little West 12th Street/Hudson River,Manhattan